{
    "tag_name": "0.2.0",
    "body": "<h3>Version 0.2.0</h3><ul><li>NEW: Much easier onboarding and initial installation walkthrough with Easy and Advanced modes according to user experience.</li><li>NEW: More intuitive way of creating new columns.</li><li>NEW: GPT-5 and GPT-5.1 models now fully supported.</li><li>NEW: Column creation using AI and keyboard shortcuts (CMD+K) with more intuitive UI.</li><li>NEW: Zotero's linked files now get indexed automatically.</li><li>NEW: Faster AI responses - instant results with powerful models like llama-3.3-70b-versatile, openai/gpt-oss-20b, and flash/lite versions from Gemini and OpenAI.</li><li>NEW: Unindexed files by Zotero now get automatically indexed in the background for the entire library.</li><li>NEW: Column header context menu option: AI Fill Empty Cells.</li><li>NEW: AI Answers now stream in real-time instead of appearing all at once.</li><li>NEW: Modern and easier-to-use interface.</li><li>NEW: New sidebar chat view replacing floating windows.</li><li>NEW: Fixed startup database connection errors with better fallback logic.</li><li>NEW: Much faster startup time.</li><li>NEW: Ready-made templates for AI Prompts to help you get started quickly.</li><li>NEW: Added Perplexity, LM Studio, and Ollama dedicated models options.</li><li>NEW: More embedding models including MTEB leaderboard top performers (via Together AI).</li></ul><h3>Version 0.1.9</h3><ul><li>NEW: Drag and drop PDF files and create custom collections without needing a Zotero account.</li><li>New: More collections customization options for icons and colors (right click).</li><li>Improved: AI processing functions and models max token size.</li><li>Improved: Lots of small UI uplifting changes.</li><li>Fixed: Lots of bugs no longer exist.</li></ul><h3>Version 0.1.8</h3><ul><li>Fixed: Some PDFs won't be reindexed</li><li>Fixed: Localhost API Key issue</li><li>Fixed: Abnormal special characters from some AI responses</li></ul><h3>Version 0.1.7</h3><ul><li>Added: DeepSeek and Qwen direct model APIs</li><li>Added: Gemini latest 2.5 models from within native API</li><li>Added: Models support for Openweb-UI</li><li>Fixed: Claude models not displayed after inserting API key</li><li>Fixed: Zotero data directory selection issue on Windows devices</li><li>Improved: Localhost embedding models support</li></ul><h3>Version 0.1.6</h3><ul><li>Added: All major AI models now available</li><li>Added: Optional text embeddings</li><li>Improved: Better support for local models</li><li>Added: Expanded display mode</li><li>Improved: Better syncing with Zotero including unavailable PDFs issues</li><li>Added: More advanced options (under settings)</li><li>Improved: Better app performance</li><li>Improved: Revamped UI</li><li>Added: Extended free access (now 14 days)</li></ul>"
}
